In [ ]:
%load_ext sql
%config SqlMagic.autocommit=False
%sql postgresql://localhost/w4111
# The following connects to the class database, but it does not support Python UDFs
# %sql postgresql://student:w4111student@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111

Setup the tables

In [ ]:
%%sql
DROP TABLE IF EXISTS sailors cascade;
DROP TABLE IF EXISTS boats cascade;
DROP TABLE IF EXISTS reserves;

CREATE TABLE sailors(
    sid serial primary key,
    name text,
    rating int,
    age int    
);
create table boats(
    bid serial primary key,
    name text,
    color text
);
create table reserves(
    sid int references sailors,
    bid int references boats,
    day text
);

INSERT INTO sailors VALUES 
(1, 'Eugene', 7, 22),
(2, 'Luis', 2, 39),
(3, 'Ken', 8, 27);
INSERT INTO boats VALUES
(101, 'Legacy', 'red'),
(102, 'Melon', 'blue'),
(103, 'Mars', 'red');
INSERT INTO reserves VALUES
(1, 102, '9/12/2016'),
(1, 101, '9/12/2016'),
(1, 103, '9/12/2016'),
(2, 102, '9/13/2016'),
(2, 103, '9/14/2016');

In [ ]:
%%sql
SELECT 	S1.sid, S1.name, S1.age, S2.name, S2.age
FROM 		Sailors AS S1, Sailors AS S2
WHERE 	S1.age > S2.age

In [ ]:
%%sql
SELECT 	S.sid
FROM 		Sailors S
WHERE 	UNIQUE (SELECT	R.sid
				 		FROM 		Reserves R
				 		WHERE		R.bid = 101 AND 
           					S.sid = R.sid)

In [ ]:
%%sql
select T.*
from (sailors left outer join reserves
      on sailors.sid = reserves.sid join boats on boats.bid = reserves.bid) AS T;

In [ ]:
%sql select * from reserves;

In [ ]:
%%sql 
select s.name 
from sailors as s, sailors 
where s.age > sailors.age;

In [ ]:
%sql select 1 AS one, 2 AS two from sailors where age * 10 < 1000;

In [ ]:
%%sql
SELECT now() - day::date < interval '20 day'
FROM Reserves

In [ ]:
%%sql 
SELECT now() - day::date FROM Reserves WHERE now() - day::date < interval '30 days';

In [ ]:
%sql select now() - '1950-07-11'::date;

In [ ]:
%sql select * from T where ((a+1)*8/b)=1 and b = 2 and c = 3;

In [ ]:
%%sql
(select 1)
except all
(select 1 union all select 1)

In [ ]:
%sql select * from reserves;

In [ ]:
%%sql
select * from sailors 
where EXISTS (SELECT reserves.bid FROM reserves WHERE bid > 103);

## Tricky Nested Queries

Sailors that reserved all boats using double negation:

In [ ]:
%%sql
SELECT 	S.name
FROM 	Sailors S
WHERE 	NOT EXISTS (
    SELECT	B.bid 
	FROM	Boats B	
	WHERE NOT EXISTS (SELECT	R.bid
                        FROM Reserves R
						WHERE	R.sid = S.sid 
						AND	R.bid = B.bid ))

What if we swapped Reserves and Boats?  Does it express the same query?

In [ ]:
%%sql
SELECT 	S.name
FROM 	Sailors S
WHERE 	NOT EXISTS (
    SELECT *
    FROM Reserves R
    WHERE NOT EXISTs (
        SELECT *
        FROM Boats B
        WHERE	R.sid = S.sid 
                AND	R.bid = B.bid 
    )
)

Why is the above not the same?  Play with the inner query to see

In [ ]:
%%sql
-- pretend we are evaluating qualification for sailor 1

    SELECT *
    FROM Reserves R
    WHERE NOT EXISTs ( -- sailor 1 should never have reserved a boat
        SELECT *
        FROM Boats B
        WHERE R.sid = 1 AND
              R.bid = B.bid 
    )

## NULLS

In [ ]:
%sql select null + null;

# Joins

In [ ]:
%%sql
DROP TABLE IF EXISTS l, r CASCADE;
CREATE TABLE l(a int, b int);
CREATE TABLE r(b int, c int);
INSERT INTO l VALUES (1, 1), (2, 2);
INSERT INTO r VALUES (2, 3), (4, 5);

In [ ]:
%%sql
SELECT * FROM l JOIN r ON l.b = r.b;

In [ ]:
%%sql
SELECT * FROM l INNER JOIN r ON l.b = r.b;

In [ ]:
%%sql
SELECT * FROM l LEFT OUTER JOIN r ON l.b = r.b;